In [1]:
import pandas as pd
df=pd.read_excel('Salary.xlsx')
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [2]:
inputs =df.drop('salary_more_then_100k',axis='columns')
#inputs we remove the target variable
target = df['salary_more_then_100k']

In [3]:
from sklearn.preprocessing import LabelEncoder
le_company=Label=LabelEncoder()
le_job=Label=LabelEncoder()
le_degree=Label=LabelEncoder()

In [4]:
#we are gettting rid of the string
#converting with label to int
inputs['company_n']=le_company.fit_transform(inputs['company'])
inputs['job_n']=le_job.fit_transform(inputs['job'])
inputs['degree_n']=le_degree.fit_transform(inputs['degree'])

inputs.head()
#change label of the column

  company                  job     degree  company_n  job_n  degree_n
0  google      sales executive  bachelors          2      2         0
1  google      sales executive    masters          2      2         1
2  google     business manager  bachelors          2      0         0
3  google     business manager    masters          2      0         1
4  google  computer programmer  bachelors          2      1         0

In [5]:
input_n=inputs.drop(['company','job','degree'],axis='columns')
input_n
#fb is coded 1, pharma is 0

    company_n  job_n  degree_n
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           2      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

In [6]:
from sklearn import tree

In [7]:
model=tree.DecisionTreeClassifier()
model.fit(input_n,target)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [8]:
model.score(input_n,target)

1.0

In [9]:
model.predict([[2,2,1]]) #google sales executer master degree
model.predict([[2,0,1]])#google sale manager master degree

array([1], dtype=int64)

In [10]:
df1=pd.read_excel('titanic.xlsx')
df1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [11]:
inputs=df1[['Pclass','Sex','Age']]
inputs.head()
target=df1['Survived']

In [20]:
#preprocessing
le_Sex=LabelEncoder()
inputs['Sex']=le_Sex.fit_transform(inputs['Sex'])
inputs=inputs.fillna(inputs.Age.median())
inputs.head()
#actual magic
model.fit(inputs,target)
model.predict_proba([[3,0,8]])

array([[1., 0.]])

In [13]:
le = LabelEncoder()
le.fit(df1['Sex'])
le_name_mapping = dict(zip(le.classes_, le.transform(le.classes_)))
print(le_name_mapping)

{'female': 0, 'male': 1}

In [23]:
model.score(inputs,target)
from sklearn.model_selection import train_test_split